Strömungssimulation/Beleg/wärmeübertrager/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.04;

boundaryField
{
    // DONE: Setzen Sie die "mixingLength" auf den halben Rohrdurchmesser.
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
	mixingLength	0.0075;
        value           uniform 0.04;
    }

    outlet
    {
        type            zeroGradient;
    }

    "pipe.*"
    {
        type            epsilonWallFunction;
        value           uniform 0.04;
    }

    frontAndBack
    {
        type            empty;
    }

    cyclic_top
    {
        type            cyclic;
    }
    cyclic_bottom
    {
        type            cyclic;
    }
}


// ************************************************************************* //
