Strömungssimulation/Beleg/wärmeübertrager/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    pipe-0
    {
        type            calculated;
        value           nonuniform List<vector> 
76
(
(-0.114077 -0.0155807 0)
(-0.114391 -0.0156226 1.35868e-20)
(-0.12695 -0.0167865 0)
(-0.126641 -0.0167459 0)
(-0.126641 0.0167459 0)
(-0.114391 0.0156226 -1.35868e-20)
(-0.108944 -0.0117218 4.767e-21)
(-0.136913 -0.00918969 8.6332e-21)
...
)
;
    }
    pipe-1
    {
        type            calculated;
        value           nonuniform List<vector> 
78
(
(-0.139341 0.00320853 -3.43787e-21)
(-0.136936 0.00918729 0)
(-0.139719 -0.00321436 -0)
(-0.13689 -0.00918154 -0)
(-0.136798 0.00917403 0)
(-0.114381 -0.0156219 -1.38575e-20)
(-0.109282 0.0117608 0)
(-0.113996 -0.0155694 4.56207e-21)
...
)
;
    }
    pipe-2
    {
        type            calculated;
        value           nonuniform List<vector> 
78
(
(-0.109235 -0.011754 -5.16683e-21)
(-0.11404 -0.0155754 -7.57419e-21)
(-0.114353 0.0156175 -1.49975e-20)
(-0.114052 0.0155775 -4.36794e-21)
(-0.126621 0.0167434 1.06129e-20)
(-0.136589 -0.00915957 0)
(-0.126538 -0.0167319 0)
(-0.126862 0.0167751 -1.33616e-20)
...
)
;
    }
    pipe-5
    {
        type            calculated;
        value           nonuniform List<vector> 
78
(
(-0.137054 0.00919117 0)
(-0.1366 0.00916015 6.57563e-21)
(-0.126543 0.0167327 0)
(-0.126865 -0.0167756 1.3362e-20)
(-0.114053 0.0155785 7.57567e-21)
(-0.114354 -0.015618 -0)
(-0.126627 -0.0167429 -1.06125e-20)
(-0.114055 -0.0155768 4.36627e-21)
...
)
;
    }
    pipe-3
    {
        type            calculated;
        value           nonuniform List<vector> 
76
(
(-0.126647 0.0167453 0)
(-0.126958 0.0167882 0)
(-0.1144 0.0156244 0)
(-0.114064 -0.0155762 -6.1959e-21)
(-0.109263 0.0117573 0)
(-0.1144 -0.0156244 0)
(-0.126958 -0.0167882 0)
(-0.126647 -0.0167453 0)
...
)
;
    }
    pipe-4
    {
        type            calculated;
        value           nonuniform List<vector> 
78
(
(-0.113999 -0.0155697 0)
(-0.109276 -0.0117583 0)
(-0.10897 0.0117249 -2.64599e-21)
(-0.126821 -0.0167699 2.38587e-20)
(-0.114382 0.0156221 1.38543e-20)
(-0.136812 -0.0091746 -1.04439e-20)
(-0.138841 -0.00319582 0)
(-0.136921 -0.0091819 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    cyclic_top
    {
        type            cyclic;
    }
    cyclic_bottom
    {
        type            cyclic;
    }
}


// ************************************************************************* //
