Strömungssimulation/Beleg/wärmeübertrager/system/avgWSS
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the area averaged normal velocity at patches.

\*---------------------------------------------------------------------------*/

type            surfaceFieldValue;
libs            ("libfieldFunctionObjects.so");

log             true;
writeControl    writeTime;
writeFields     false;

select          patch;
// DONE: UNSISCHER patch name eintragen
name            outlet;

operation       areaAverage;

fields
(
    wallShearStress 
);

// ************************************************************************* //
