Strömungssimulation/Beleg/wärmeübertrager/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// include packaged functionObjects using #includeFunc
#includeFunc residuals


// DONE: Aktivieren Sie die functionObjects durch entfernen des Kommentarsymbole "//"
//       Ergänzen Sie nach Bedarf weitere functionObjects
// #includeFunc wallShearStress
// #includeFunc yPlus

#includeFunc forcesPipe

#includeFunc avgPres
// #includeFunc avgWSS

// ************************************************************************* //
