Strömungssimulation/Beleg/wärmeübertrager/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    pcorr
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        smoother        GaussSeidel;
    }

    "(U|k|epsilon|omega|f|v2)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.005;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
//    consistent		yes;

//    pRefCell 0;
//    pRefValue 0;

    // DONE: Abbruchkriterien so wählen, dass Konvergenz erreicht wird.
    residualControl
    {
        p               1e-3;
        U               2e-3;
        "(k|epsilon|omega|f|v2)" 1e-3;
    }
}

relaxationFactors
{
    equations
    {
//	U		0.85;
//	".*"		0.9;
        U               0.7; // 0.9 is more stable but 0.95 more convergent
        "(k|epsilon|omega)"   0.8; // 0.9 is more stable but 0.95 more convergent
    }
    fields
    {
	p		0.3;
    }
}


// ************************************************************************* //
